log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** Template Haskell and Cross Compilation
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-05-24-template-haskell-and-cross-compilation
   :EXPORT_DATE: <2017-05-24>
   :ID:       67891586-9BA9-4209-81F8-B9B9AB14E173
   :END:

[[https://medium.com/@zw3rk/quick-headless-raspberry-pi-setup-52ad6dd312c4][Over]] [[https://medium.com/@zw3rk/making-a-raspbian-cross-compilation-sdk-830fe56d75ba][the]] [[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-raspberry-pi-ddd9d41ced94][last]] [[https://medium.com/@zw3rk/the-haskell-cabal-and-cross-compilation-e9885fd5e2f][two]] [[https://medium.com/@zw3rk/why-use-a-cross-compiler-92322ef46e32][weeks]] we have seen how to build a Haskell cross
compiler for the [[http://amzn.to/2qb8k10][Raspberry Pi]]. We have also seen a high level overview
of [[https://medium.com/@zw3rk/template-haskell-75c7b67f9718][Template Haskell]]. Today we will look at what Template Haskell means
in the context of cross compilation.

As [[https://medium.com/@zw3rk/template-haskell-75c7b67f9718][pointed out yesterday]], Template Haskell requires that GHC is able
to run the object code for the Template Haskell function. This in turn
requires GHC to be able to load this code into memory and make it
executable. Therein leis the first problem; our compiler is a cross
compiler and produces code to run on the /host/, say Raspberry Pi, and
not on the machine we /build/ it on. Thus we can not natively load and
run the Template Haskell function on the same machine that GHC runs
on, because our /host/ is different from our /build/ machine.

*** Existing Solutions
    :PROPERTIES:
    :ID:       242BE89B-1236-45C3-8F67-EB2CA3FFFC63
    :END:

In [[https://medium.com/@zw3rk/the-haskell-cabal-and-cross-compilation-e9885fd5e2f][The Haskell Cabal and Cross Compilation]] post, I've mentioned [[https://git-annex.branchable.com/design/assistant/blog/day_236__evil_splicer/][evil
splicer]] and [[https://hackage.haskell.org/package/zeroth][ZeroTH]].  Both use a strategy where the Template Haskell
splices are extracted from the source, compiled on the /build/ machine,
and the results are then spliced back into their places. This however
implies that the splices are evaluated on the /build/ machine with
libraries build for the /build/ machine. Subtle differences between
/build/ and /host/ can potentially lead to incorrect results (e.g. 32 vs
64bit).

[[https://github.com/ghcjs/ghcjs][GHCJS]] is a Haskell to JavaScript compiler that uses the GHC API. As
such it is also a cross compiler as its /target/ is a JavaScript
runtime, while GHCJS itself does not run on the JavaScript
runtime. GHCJS however supports Template Haskell via its [[https://github.com/ghcjs/ghcjs/wiki/Porting-GHCJS-Template-Haskell-to-GHC][out of
process Template Haskell solution]] for some time now. GHCJS does this
by running a [[https://nodejs.org][node.js]] server. GHCJS transfers the compiled Template
Haskell code to the server process, links and evaluates it there and
ship the result back to the GHCJS process.

Since GHC 8.0.1, GHC has [[https://ghc.haskell.org/trac/ghc/wiki/Commentary/Compiler/ExternalInterpreter][The External Interpreter]], which provides
support for a very similar mechanism. If GHC is provided with the
=-fexternal-interpreter= flag, it will evaluate interpreted code in a
separate process.

If we tried a similar approach to GHCJS with our Raspberry Pi (and we
will tomorrow), we would run into an issue that is transparent to
GHCJS, but not in our case. GHCJS runs the node.js server /on the same
machine/. This is important, because it means that the node.js process
sees /the same file system/ that GHCJS sees. It also can shell out to
any process GHCJS could shell out to, because the run on /the same
machine./

Therefore, if we transfer, link and run a Template Haskell function on
our /host/ (here: Raspberry Pi), it will not see the same file system or
be able to shell out to the same processes that GHC could. The
Template Haskell function will see the /hosts/ and not the /build/
machines environment. This is contrary to what many packages that use
Template Haskell assume; they assume to operate in the same
environment, can access the same file system, and call the same
commands the GHC process can. For example the [[https://hackage.haskell.org/package/gitrev][gitrev]] package, which
allows among others to embed the git repository hash into the program,
natively assumes that it can operate in the same environment in which
GHC is operating; the one that has =git= available and contains the
module that is being compiled, and into which the git hash is supposed
to be embedded.

*** File and Process IO Example
    :PROPERTIES:
    :ID:       09678DC6-8AB8-4D13-933E-E6FF3467BDE9
    :END:

An example where both file IO, and process IO might be used would be
an application that wants to reproduce the licenses of the libraries
it uses, and provide a version with a git hash to identify the exact
commit from which it was built. While we could use a separate file
containing the licenses, we opt to actually include the licenses /in
the binary/.  We'll assume that our =Main.hs= is in a git repository and
our licenses are aggregated in a =LICENSES= file.

#+BEGIN_EXAMPLE
  {-# LANGUAGE TemplateHaskell, LambdaCase #-}
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  module Main where
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  import Development.GitRev (gitHash)
  import Data.FileEmbed     (embedStringFile)
  import System.Environment (getProgName, getArgs)
  import System.Exit        (die)
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  main :: IO ()
  main = getArgs >>= \case
    ["--licenses"] -> putStrLn $(embedStringFile "LICENSES")
    ["--version"]  -> putStrLn ("Version " ++ $gitHash)
    _otherwise     -> do
      prog <- getProgName
      die $ "usage: " ++ prog ++ " [--licenses] [--version]"
#+END_EXAMPLE

While this is clearly some rather [[https://github.com/zw3rk/medium/tree/master/template-haskell-and-cross-compilation][contrived code]], this rather simple,
innocent looking snipped can not trivially be cross compiled. When GHC
encounters the =$(embedStringFile "LICENSES")= splice, it will build a
bytecode object (BCO), that calls =embedStringFile= with
="LICENSES"=. Thus loading the =file-embed= library, and evaluating the
BCO. The BCO requests a handle on the =embedStringFile= function, and
invokes it with ="LICENSES"=.  While this could execute perfectly fine
on the /host/, the function =runIO= is opaque to GHC, and GHC can't tell
if the =IO= action will /read/write files/ or /call a program/. GHC would
simply try to read the =LICENSES= file on the /host./ This was not our
intention! The same holds for the =$gitHash= splice, from which we
expect to run =git= on the /build/ machine and obtain the git hash of the
/source directory/.

*** Summary
    :PROPERTIES:
    :ID:       1780686B-3E7B-4E02-A6C8-80E7E7D72B0C
    :END:

We have now seen that Template Haskell poses some interesting problems
for cross compilation that require GHC to be able to load, link, and
evaluate object code on the /host/. Due to the environmental differences
(file system, available programs, ...) the inability to execute
Template Haskell functions on the /build/ machine makes file and process
IO nonsensical.

